
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/goda6565/ptf-backends/actions/runs/13281090074)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.vpc.data.aws_availability_zones.current: Reading...
module.ssm_parameters.aws_ssm_parameter.ssm_parameter["TEST_SECRET"]: Refreshing state... [id=/ptf-golang-app/TEST_SECRET]
module.ecr.aws_ecr_repository.ecr_repository: Refreshing state... [id=ptf-golang-app-ecr-repository]
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-062502fa3da223272]
module.vpc.data.aws_availability_zones.current: Read complete after 1s [id=ap-northeast-1]
module.ecr.aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Refreshing state... [id=ptf-golang-app-ecr-repository]
module.ecs.data.aws_region.current: Reading...
module.ecs.data.aws_iam_policy_document.ecs_task_execution_assume_role: Reading...
module.ecs.data.aws_vpc.this: Reading...
module.ecs.data.aws_iam_policy.managed_ecs_task_execution: Reading...
module.ecs.aws_cloudwatch_log_group.ecs_log_group: Refreshing state... [id=/ecs/ptf-golang-app]
module.ecs.data.aws_iam_policy_document.ecs_task: Reading...
module.ecs.data.aws_iam_policy_document.ecs_task_assume_role: Reading...
module.ecs.aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:061051222129:cluster/ptf-golang-app-ecs-cluster]
module.ecs.data.aws_caller_identity.current: Reading...
module.ecs.data.aws_iam_policy_document.ecs_task_assume_role: Read complete after 0s [id=1077804475]
module.ecs.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.ecs.data.aws_iam_policy_document.ecs_task: Read complete after 0s [id=3621793318]
module.ecs.data.aws_iam_policy_document.ecs_task_execution_assume_role: Read complete after 0s [id=1077804475]
module.ecs.data.aws_ssm_parameters_by_path.ssm_parameters: Reading...
module.ecs.data.aws_ecr_repository.ecr_repository: Reading...
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ptf-golang-app-ecs-task-execution-role]
module.ecs.aws_iam_role.ecs_task: Refreshing state... [id=ptf-golang-app-ecs-task-role]
module.ecs.data.aws_caller_identity.current: Read complete after 0s [id=061051222129]
module.ecs.data.aws_ssm_parameters_by_path.ssm_parameters: Read complete after 0s [id=/ptf-golang-app/]
module.ecs.data.aws_iam_policy_document.ecs_task_execution: Reading...
module.ecs.data.aws_iam_policy_document.ecs_task_execution: Read complete after 0s [id=2439931457]
module.ecs.data.aws_ecr_repository.ecr_repository: Read complete after 0s [id=ptf-golang-app-ecr-repository]
module.ecs.aws_ecs_cluster_capacity_providers.ecs_capacity_provider: Refreshing state... [id=ptf-golang-app-ecs-cluster]
module.ecs.aws_iam_role_policy.ecs_task_inline_policy: Refreshing state... [id=ptf-golang-app-ecs-task-role:ptf-golang-app-ecs-task-inline-policy]
module.vpc.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d6da820ea8bff2f5]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0d4ddafd54b0e8e6d]
module.vpc.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-022ffaeb3938341dc]
module.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-058e4463b31cabeb4]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-092ff86b17e91c9a0]
module.vpc.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-06c5b691ad9c5ec00]
module.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0edf353447e0c4c07]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-08677ace5ecc14721]
module.ecs.data.aws_vpc.this: Read complete after 1s [id=vpc-062502fa3da223272]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-02a749fbdb6442c1c]
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-022b9ab78999bf577]
module.ecs.aws_ecs_task_definition.ecs_task_definition: Refreshing state... [id=ptf-golang-app]
module.ecs.aws_iam_role_policy.ecs_task_execution_inline_policy: Refreshing state... [id=ptf-golang-app-ecs-task-execution-role:ptf-golang-app-ecs-task-execution-inline-policy]
module.ecs.aws_security_group.alb: Refreshing state... [id=sg-0479ef1bd7517e71e]
module.ecs.aws_security_group.ecs_instance: Refreshing state... [id=sg-0b0793bd658597427]
module.ecs.aws_lb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:061051222129:targetgroup/ptf-golang-app-alb-target-group/67a6d6df33d96e81]
module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-073f8632a48f23263]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0f42716b63fbb2012]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-022b9ab78999bf5771080289494]
module.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0edc2cfdda7630355]
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-06ec7371ef5e51ed0]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0873f1d2c670716d7]
module.ecs.aws_vpc_security_group_ingress_rule.alb_from_http: Refreshing state... [id=sgr-09c2e028d8b402a05]
module.ecs.aws_vpc_security_group_egress_rule.ecs_instance_to_https: Refreshing state... [id=sgr-07904dfac92d40280]
module.ecs.aws_vpc_security_group_egress_rule.lb_to_ecs_instance: Refreshing state... [id=sgr-08da339f8e531b742]
module.ecs.aws_vpc_security_group_ingress_rule.ecs_instance_from_alb: Refreshing state... [id=sgr-05fcf29d9394a7a7e]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0443e09db44c67b08]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-02a749fbdb6442c1c1080289494]
module.ecs.data.aws_iam_policy.managed_ecs_task_execution: Read complete after 2s [id=arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]
module.ecs.aws_iam_role_policy_attachments_exclusive.ecs_task_execution_managed_policy: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "arn:aws:ecs:ap-northeast-1:061051222129:cluster/ptf-golang-app-ecs-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 0
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = true
      + health_check_grace_period_seconds  = 60
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "ptf-golang-app-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = "arn:aws:ecs:ap-northeast-1:061051222129:task-definition/ptf-golang-app:1"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = false
        }

      + load_balancer {
          + container_name   = "ptf-golang-app"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:061051222129:targetgroup/ptf-golang-app-alb-target-group/67a6d6df33d96e81"
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0b0793bd658597427",
            ]
          + subnets          = [
              + "subnet-092ff86b17e91c9a0",
              + "subnet-0edf353447e0c4c07",
            ]
        }
    }

  # module.ecs.aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "ptf-golang-app-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + "sg-0479ef1bd7517e71e",
        ]
      + subnets                                                      = [
          + "subnet-058e4463b31cabeb4",
          + "subnet-0d4ddafd54b0e8e6d",
        ]
      + tags_all                                                     = (known after apply)
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # module.ecs.aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }

      + mutual_authentication (known after apply)
    }

  # module.ecs.aws_lb_listener_rule.alb_listener_rule will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:061051222129:targetgroup/ptf-golang-app-alb-target-group/67a6d6df33d96e81"
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
module.ecs.aws_lb.alb: Creating...
module.ecs.aws_lb.alb: Still creating... [10s elapsed]
module.ecs.aws_lb.alb: Still creating... [20s elapsed]
module.ecs.aws_lb.alb: Still creating... [30s elapsed]
module.ecs.aws_lb.alb: Still creating... [40s elapsed]
module.ecs.aws_lb.alb: Still creating... [50s elapsed]
module.ecs.aws_lb.alb: Still creating... [1m0s elapsed]
module.ecs.aws_lb.alb: Still creating... [1m10s elapsed]
module.ecs.aws_lb.alb: Still creating... [1m20s elapsed]
module.ecs.aws_lb.alb: Still creating... [1m30s elapsed]
module.ecs.aws_lb.alb: Still creating... [1m40s elapsed]
module.ecs.aws_lb.alb: Still creating... [1m50s elapsed]
module.ecs.aws_lb.alb: Still creating... [2m0s elapsed]
module.ecs.aws_lb.alb: Still creating... [2m10s elapsed]
module.ecs.aws_lb.alb: Still creating... [2m20s elapsed]
module.ecs.aws_lb.alb: Still creating... [2m30s elapsed]
module.ecs.aws_lb.alb: Still creating... [2m40s elapsed]
module.ecs.aws_lb.alb: Still creating... [2m50s elapsed]
module.ecs.aws_lb.alb: Still creating... [3m0s elapsed]
module.ecs.aws_lb.alb: Creation complete after 3m5s [id=arn:aws:elasticloadbalancing:ap-northeast-1:061051222129:loadbalancer/app/ptf-golang-app-alb/d5c20082f08d4c80]
module.ecs.aws_lb_listener.alb_listener: Creating...
module.ecs.aws_lb_listener.alb_listener: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:061051222129:listener/app/ptf-golang-app-alb/d5c20082f08d4c80/78216f6d064a828f]
module.ecs.aws_lb_listener_rule.alb_listener_rule: Creating...
module.ecs.aws_lb_listener_rule.alb_listener_rule: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:061051222129:listener-rule/app/ptf-golang-app-alb/d5c20082f08d4c80/78216f6d064a828f/fec7be7646d37c41]
module.ecs.aws_ecs_service.ecs_service: Creating...
module.ecs.aws_ecs_service.ecs_service: Creation complete after 1s [id=arn:aws:ecs:ap-northeast-1:061051222129:service/ptf-golang-app-ecs-cluster/ptf-golang-app-ecs-service]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":5,"Program":"tfcmt","SHA1":"5480d449863d5c829af6c27dcd5d3d686dae5133","Vars":{},"WorkflowName":"Terraform"} -->